const provinceCodeMap = [
  { code: '101', name: '上海' },
  { code: '102', name: '天津' },
  { code: '103', name: '重庆' },
  { code: '104', name: '北京' },
  { code: '201', name: '安徽' },
  { code: '202', name: '福建' },
  { code: '203', name: '甘肃' },
  { code: '204', name: '广东' },
  { code: '205', name: '广西' },
  { code: '206', name: '贵州' },
  { code: '207', name: '海南' },
  { code: '208', name: '河北' },
  { code: '209', name: '黑龙江' },
  { code: '210', name: '湖北' },
  { code: '211', name: '湖南' },
  { code: '212', name: '吉林' },
  { code: '213', name: '江苏' },
  { code: '214', name: '辽宁' },
  { code: '215', name: '江西' },
  { code: '216', name: '内蒙古' },
  { code: '217', name: '宁夏' },
  { code: '218', name: '青海' },
  { code: '219', name: '山东' },
  { code: '220', name: '山西' },
  { code: '221', name: '陕西' },
  { code: '222', name: '四川' },
  { code: '223', name: '新疆' },
  { code: '224', name: '云南' },
  { code: '225', name: '浙江' },
  { code: '226', name: '河南' }
]

const cityLetterMap = {
  '101': [{ l: 'A', n: '上海' }, { l: 'B', n: '上海浦东' }, { l: 'C', n: '上海郊区' }, { l: 'D', n: '上海崇明' }],
  '102': [{ l: 'A', n: '天津' }, { l: 'B', n: '天津滨海' }, { l: 'C', n: '天津郊区' }],
  '103': [{ l: 'A', n: '重庆' }, { l: 'B', n: '重庆涪陵' }, { l: 'C', n: '重庆永川' }, { l: 'F', n: '重庆万州' }, { l: 'G', n: '重庆涪陵' }, { l: 'H', n: '重庆黔江' }],
  '104': [{ l: 'A', n: '北京' }, { l: 'B', n: '北京出租' }, { l: 'C', n: '北京城区' }, { l: 'E', n: '北京城区' }, { l: 'F', n: '北京城区' }, { l: 'G', n: '北京郊区' }, { l: 'H', n: '北京城区' }, { l: 'J', n: '北京城区' }, { l: 'K', n: '北京城区' }, { l: 'L', n: '北京城区' }, { l: 'M', n: '北京城区' }, { l: 'N', n: '北京城区' }, { l: 'P', n: '北京城区' }, { l: 'Q', n: '北京城区' }, { l: 'Y', n: '北京郊区' }],
  '201': [{ l: 'A', n: '合肥' }, { l: 'B', n: '芜湖' }, { l: 'C', n: '蚌埠' }, { l: 'D', n: '淮南' }, { l: 'E', n: '马鞍山' }, { l: 'F', n: '淮北' }, { l: 'G', n: '铜陵' }, { l: 'H', n: '安庆' }, { l: 'J', n: '黄山' }, { l: 'K', n: '阜阳' }, { l: 'L', n: '宿州' }, { l: 'M', n: '滁州' }, { l: 'N', n: '六安' }, { l: 'P', n: '宣城' }, { l: 'Q', n: '巢湖' }, { l: 'R', n: '池州' }, { l: 'S', n: '亳州' }],
  '202': [{ l: 'A', n: '福州' }, { l: 'B', n: '莆田' }, { l: 'C', n: '泉州' }, { l: 'D', n: '厦门' }, { l: 'E', n: '漳州' }, { l: 'F', n: '龙岩' }, { l: 'G', n: '三明' }, { l: 'H', n: '南平' }, { l: 'J', n: '宁德' }, { l: 'K', n: '平潭' }],
  '203': [{ l: 'A', n: '兰州' }, { l: 'B', n: '嘉峪关' }, { l: 'C', n: '金昌' }, { l: 'D', n: '白银' }, { l: 'E', n: '天水' }, { l: 'F', n: '酒泉' }, { l: 'G', n: '张掖' }, { l: 'H', n: '武威' }, { l: 'J', n: '定西' }, { l: 'K', n: '陇南' }, { l: 'L', n: '平凉' }, { l: 'M', n: '庆阳' }, { l: 'N', n: '临夏' }, { l: 'P', n: '甘南' }],
  '204': [{ l: 'A', n: '广州' }, { l: 'B', n: '深圳' }, { l: 'C', n: '珠海' }, { l: 'D', n: '汕头' }, { l: 'E', n: '佛山' }, { l: 'F', n: '韶关' }, { l: 'G', n: '湛江' }, { l: 'H', n: '肇庆' }, { l: 'J', n: '江门' }, { l: 'K', n: '茂名' }, { l: 'L', n: '惠州' }, { l: 'M', n: '梅州' }, { l: 'N', n: '汕尾' }, { l: 'P', n: '河源' }, { l: 'Q', n: '阳江' }, { l: 'R', n: '清远' }, { l: 'S', n: '东莞' }, { l: 'T', n: '中山' }, { l: 'U', n: '潮州' }, { l: 'V', n: '揭阳' }, { l: 'W', n: '云浮' }, { l: 'X', n: '顺德' }, { l: 'Y', n: '南海' }, { l: 'Z', n: '港澳进入内地车辆' }],
  '205': [{ l: 'A', n: '南宁' }, { l: 'B', n: '柳州' }, { l: 'C', n: '桂林' }, { l: 'D', n: '梧州' }, { l: 'E', n: '北海' }, { l: 'F', n: '崇左' }, { l: 'G', n: '来宾' }, { l: 'H', n: '桂林' }, { l: 'J', n: '贺州' }, { l: 'K', n: '玉林' }, { l: 'L', n: '百色' }, { l: 'M', n: '河池' }, { l: 'N', n: '钦州' }, { l: 'P', n: '防城港' }, { l: 'R', n: '贵港' }],
  '206': [{ l: 'A', n: '贵阳' }, { l: 'B', n: '六盘水' }, { l: 'C', n: '遵义' }, { l: 'D', n: '铜仁' }, { l: 'E', n: '黔西南' }, { l: 'F', n: '毕节' }, { l: 'G', n: '安顺' }, { l: 'H', n: '黔东南' }, { l: 'J', n: '黔南' }],
  '207': [{ l: 'A', n: '海口' }, { l: 'B', n: '三亚' }, { l: 'C', n: '琼北' }, { l: 'D', n: '琼南' }, { l: 'E', n: '洋浦' }, { l: 'F', n: '儋州' }],
  '208': [{ l: 'A', n: '石家庄' }, { l: 'B', n: '唐山' }, { l: 'C', n: '秦皇岛' }, { l: 'D', n: '邯郸' }, { l: 'E', n: '邢台' }, { l: 'F', n: '保定' }, { l: 'G', n: '张家口' }, { l: 'H', n: '承德' }, { l: 'J', n: '沧州' }, { l: 'K', n: '廊坊' }, { l: 'L', n: '衡水' }, { l: 'R', n: '华北油田' }, { l: 'T', n: '唐山曹妃甸' }],
  '209': [{ l: 'A', n: '哈尔滨' }, { l: 'B', n: '齐齐哈尔' }, { l: 'C', n: '牡丹江' }, { l: 'D', n: '佳木斯' }, { l: 'E', n: '大庆' }, { l: 'F', n: '伊春' }, { l: 'G', n: '鸡西' }, { l: 'H', n: '鹤岗' }, { l: 'J', n: '双鸭山' }, { l: 'K', n: '七台河' }, { l: 'L', n: '松花江' }, { l: 'M', n: '绥化' }, { l: 'N', n: '黑河' }, { l: 'P', n: '大兴安岭' }, { l: 'R', n: '农垦系统' }],
  '210': [{ l: 'A', n: '武汉' }, { l: 'B', n: '黄石' }, { l: 'C', n: '十堰' }, { l: 'D', n: '荆州' }, { l: 'E', n: '宜昌' }, { l: 'F', n: '襄阳' }, { l: 'G', n: '鄂州' }, { l: 'H', n: '荆门' }, { l: 'J', n: '黄冈' }, { l: 'K', n: '孝感' }, { l: 'L', n: '咸宁' }, { l: 'M', n: '仙桃' }, { l: 'N', n: '潜江' }, { l: 'P', n: '神农架' }, { l: 'Q', n: '恩施' }, { l: 'R', n: '天门' }, { l: 'S', n: '随州' }],
  '211': [{ l: 'A', n: '长沙' }, { l: 'B', n: '株洲' }, { l: 'C', n: '湘潭' }, { l: 'D', n: '衡阳' }, { l: 'E', n: '邵阳' }, { l: 'F', n: '岳阳' }, { l: 'G', n: '张家界' }, { l: 'H', n: '益阳' }, { l: 'J', n: '常德' }, { l: 'K', n: '娄底' }, { l: 'L', n: '郴州' }, { l: 'M', n: '永州' }, { l: 'N', n: '怀化' }, { l: 'U', n: '湘西' }],
  '212': [{ l: 'A', n: '长春' }, { l: 'B', n: '吉林' }, { l: 'C', n: '四平' }, { l: 'D', n: '辽源' }, { l: 'E', n: '通化' }, { l: 'F', n: '白山' }, { l: 'G', n: '白城' }, { l: 'H', n: '延边' }, { l: 'J', n: '松原' }],
  '213': [{ l: 'A', n: '南京' }, { l: 'B', n: '无锡' }, { l: 'C', n: '徐州' }, { l: 'D', n: '常州' }, { l: 'E', n: '苏州' }, { l: 'F', n: '南通' }, { l: 'G', n: '连云港' }, { l: 'H', n: '淮安' }, { l: 'J', n: '盐城' }, { l: 'K', n: '扬州' }, { l: 'L', n: '镇江' }, { l: 'M', n: '泰州' }, { l: 'N', n: '宿迁' }],
  '214': [{ l: 'A', n: '沈阳' }, { l: 'B', n: '大连' }, { l: 'C', n: '鞍山' }, { l: 'D', n: '抚顺' }, { l: 'E', n: '本溪' }, { l: 'F', n: '丹东' }, { l: 'G', n: '锦州' }, { l: 'H', n: '营口' }, { l: 'J', n: '阜新' }, { l: 'K', n: '辽阳' }, { l: 'L', n: '盘锦' }, { l: 'M', n: '铁岭' }, { l: 'N', n: '朝阳' }, { l: 'P', n: '葫芦岛' }],
  '215': [{ l: 'A', n: '南昌' }, { l: 'B', n: '赣州' }, { l: 'C', n: '宜春' }, { l: 'D', n: '吉安' }, { l: 'E', n: '上饶' }, { l: 'F', n: '抚州' }, { l: 'G', n: '九江' }, { l: 'H', n: '景德镇' }, { l: 'J', n: '萍乡' }, { l: 'K', n: '新余' }, { l: 'L', n: '鹰潭' }, { l: 'M', n: '南昌增补' }],
  '216': [{ l: 'A', n: '呼和浩特' }, { l: 'B', n: '包头' }, { l: 'C', n: '乌海' }, { l: 'D', n: '赤峰' }, { l: 'E', n: '呼伦贝尔' }, { l: 'F', n: '兴安' }, { l: 'G', n: '通辽' }, { l: 'H', n: '锡林郭勒' }, { l: 'J', n: '乌兰察布' }, { l: 'K', n: '鄂尔多斯' }, { l: 'L', n: '巴彦淖尔' }, { l: 'M', n: '阿拉善' }],
  '217': [{ l: 'A', n: '银川' }, { l: 'B', n: '石嘴山' }, { l: 'C', n: '吴忠' }, { l: 'D', n: '固原' }, { l: 'E', n: '中卫' }],
  '218': [{ l: 'A', n: '西宁' }, { l: 'B', n: '海东' }, { l: 'C', n: '海北' }, { l: 'D', n: '黄南' }, { l: 'E', n: '海南' }, { l: 'F', n: '果洛' }, { l: 'G', n: '玉树' }, { l: 'H', n: '海西' }],
  '219': [{ l: 'A', n: '济南' }, { l: 'B', n: '青岛' }, { l: 'C', n: '淄博' }, { l: 'D', n: '枣庄' }, { l: 'E', n: '东营' }, { l: 'F', n: '烟台' }, { l: 'G', n: '潍坊' }, { l: 'H', n: '济宁' }, { l: 'J', n: '泰安' }, { l: 'K', n: '威海' }, { l: 'L', n: '日照' }, { l: 'M', n: '滨州' }, { l: 'N', n: '德州' }, { l: 'P', n: '聊城' }, { l: 'Q', n: '临沂' }, { l: 'R', n: '菏泽' }, { l: 'S', n: '莱芜' }, { l: 'U', n: '青岛增补' }, { l: 'V', n: '潍坊增补' }, { l: 'Y', n: '烟台增补' }],
  '220': [{ l: 'A', n: '太原' }, { l: 'B', n: '大同' }, { l: 'C', n: '阳泉' }, { l: 'D', n: '长治' }, { l: 'E', n: '晋城' }, { l: 'F', n: '朔州' }, { l: 'H', n: '忻州' }, { l: 'J', n: '吕梁' }, { l: 'K', n: '晋中' }, { l: 'L', n: '临汾' }, { l: 'M', n: '运城' }],
  '221': [{ l: 'A', n: '西安' }, { l: 'B', n: '铜川' }, { l: 'C', n: '宝鸡' }, { l: 'D', n: '咸阳' }, { l: 'E', n: '渭南' }, { l: 'F', n: '汉中' }, { l: 'G', n: '安康' }, { l: 'H', n: '商洛' }, { l: 'J', n: '延安' }, { l: 'K', n: '榆林' }, { l: 'U', n: '省直系统' }, { l: 'V', n: '杨凌' }],
  '222': [{ l: 'A', n: '成都' }, { l: 'B', n: '绵阳' }, { l: 'C', n: '自贡' }, { l: 'D', n: '攀枝花' }, { l: 'E', n: '泸州' }, { l: 'F', n: '德阳' }, { l: 'H', n: '广元' }, { l: 'J', n: '遂宁' }, { l: 'K', n: '内江' }, { l: 'L', n: '乐山' }, { l: 'M', n: '资阳' }, { l: 'Q', n: '宜宾' }, { l: 'R', n: '南充' }, { l: 'S', n: '达州' }, { l: 'T', n: '雅安' }, { l: 'U', n: '阿坝' }, { l: 'V', n: '甘孜' }, { l: 'W', n: '凉山' }, { l: 'X', n: '广安' }, { l: 'Y', n: '巴中' }, { l: 'Z', n: '眉山' }],
  '223': [{ l: 'A', n: '乌鲁木齐' }, { l: 'B', n: '昌吉' }, { l: 'C', n: '石河子' }, { l: 'D', n: '奎屯' }, { l: 'E', n: '博尔塔拉' }, { l: 'F', n: '伊犁' }, { l: 'G', n: '塔城' }, { l: 'H', n: '阿勒泰' }, { l: 'J', n: '克拉玛依' }, { l: 'K', n: '吐鲁番' }, { l: 'L', n: '哈密' }, { l: 'M', n: '巴音郭楞' }, { l: 'N', n: '阿克苏' }, { l: 'P', n: '克孜勒苏' }, { l: 'Q', n: '喀什' }, { l: 'R', n: '和田' }],
  '224': [{ l: 'A', n: '昆明' }, { l: 'C', n: '昭通' }, { l: 'D', n: '曲靖' }, { l: 'E', n: '楚雄' }, { l: 'F', n: '玉溪' }, { l: 'G', n: '红河' }, { l: 'H', n: '文山' }, { l: 'J', n: '普洱' }, { l: 'K', n: '西双版纳' }, { l: 'L', n: '大理' }, { l: 'M', n: '保山' }, { l: 'N', n: '德宏' }, { l: 'P', n: '丽江' }, { l: 'Q', n: '怒江' }, { l: 'R', n: '迪庆' }, { l: 'S', n: '临沧' }],
  '225': [{ l: 'A', n: '杭州' }, { l: 'B', n: '宁波' }, { l: 'C', n: '温州' }, { l: 'D', n: '绍兴' }, { l: 'E', n: '湖州' }, { l: 'F', n: '嘉兴' }, { l: 'G', n: '金华' }, { l: 'H', n: '衢州' }, { l: 'J', n: '台州' }, { l: 'K', n: '丽水' }, { l: 'L', n: '舟山' }],
  '226': [{ l: 'A', n: '郑州' }, { l: 'B', n: '开封' }, { l: 'C', n: '洛阳' }, { l: 'D', n: '平顶山' }, { l: 'E', n: '安阳' }, { l: 'F', n: '鹤壁' }, { l: 'G', n: '新乡' }, { l: 'H', n: '焦作' }, { l: 'J', n: '濮阳' }, { l: 'K', n: '许昌' }, { l: 'L', n: '漯河' }, { l: 'M', n: '三门峡' }, { l: 'N', n: '商丘' }, { l: 'P', n: '周口' }, { l: 'Q', n: '驻马店' }, { l: 'R', n: '南阳' }, { l: 'S', n: '信阳' }, { l: 'U', n: '济源' }]
}

const cityLetterList = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K', 'L', 'M', 'N', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']


function normalizeCityName(name) {
  return String(name || '').replace(/市$/, '').replace(/地区$/, '').replace(/自治州$/, '').replace(/盟$/, '')
}

const provinceNameCodeMap = provinceCodeMap.reduce(function(map, item) {
  map[item.name] = item.code
  map[item.name + '省'] = item.code
  map[item.name + '市'] = item.code
  return map
}, {
  '广西壮族自治区': '205',
  '内蒙古自治区': '216',
  '宁夏回族自治区': '217',
  '新疆维吾尔自治区': '223'
})

const cityNameLetterMap = Object.keys(cityLetterMap).reduce(function(map, provinceCode) {
  cityLetterMap[provinceCode].forEach(function(item) {
    map[item.n] = item.l
    map[item.n + '市'] = item.l
    map[normalizeCityName(item.n)] = item.l
  })
  return map
}, {})

module.exports = {
  provinceCodeMap,
  cityLetterMap,
  cityLetterList,
  provinceNameCodeMap,
  cityNameLetterMap,
  normalizeCityName
}
